export class PropertyDto {
  /** Уникальный ID объекта недвижимости (UUID) */
  id!: string;

  /** Название объекта недвижимости */
  name!: string;

  /** Описание объекта недвижимости */
  description!: string;

  /** Цена за месяц аренды */
  pricePerMonth!: number;

  /** Сумма депозита за аренду */
  securityDeposit!: number;

  /** Сумма за подачу заявки на аренду */
  applicationFee!: number;

  /** Список URL фотографий объекта недвижимости */
  photoUrls!: string[];

  /** Разрешены ли домашние животные? */
  isPetsAllowed!: boolean;

  /** Включена ли парковка? */
  isParkingIncluded!: boolean;

  /** Количество спален в объекте недвижимости */
  beds!: number;

  /** Количество ванных комнат в объекте недвижимости */
  baths!: number;

  /** Площадь объекта недвижимости в квадратных футах */
  squareFeet!: number;

  /** Тип объекта недвижимости (например, квартира, дом) */
  propertyType!: string;

  /** Адрес объекта недвижимости */
  address!: string;

  /** Почтовый индекс объекта недвижимости */
  postalCode!: string;

  /** Широта географического расположения объекта недвижимости */
  latitude!: number;

  /** Долгота географического расположения объекта недвижимости */
  longitude!: number;

  /** Дата публикации объекта недвижимости (ISO строка) */
  postedDate!: string;


  /** Средний рейтинг объекта недвижимости (от 0 до 5) */
  averageRating!: number;

  /** Количество отзывов о объекте недвижимости */
  numberOfReviews!: number;
}
